load-balancer-test.yml
config:
  target: "http://192.168.100.5"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "Load page"
    flow:
      - get:
          url: "/"